Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxPsi5_bf.h
/** \brief Length for Ifx_PSI5_CH_RDRH_Bits.TS */
#define IFX_PSI5_CH_RDRH_TS_LEN (24u)

/** \brief Mask for Ifx_PSI5_CH_RDRH_Bits.TS */
#define IFX_PSI5_CH_RDRH_TS_MSK (0xffffffu)

/** \brief Offset for Ifx_PSI5_CH_RDRH_Bits.TS */
#define IFX_PSI5_CH_RDRH_TS_OFF (0u)

/** \brief Length for Ifx_PSI5_CH_RDRH_Bits.SC */
#define IFX_PSI5_CH_RDRH_SC_LEN (3u)

/** \brief Mask for Ifx_PSI5_CH_RDRH_Bits.SC */
#define IFX_PSI5_CH_RDRH_SC_MSK (0x7u)

/** \brief Offset for Ifx_PSI5_CH_RDRH_Bits.SC */
#define IFX_PSI5_CH_RDRH_SC_OFF (24u)

/** \brief Length for Ifx_PSI5_CH_RDRH_Bits.TEI */
#define IFX_PSI5_CH_RDRH_TEI_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_RDRH_Bits.TEI */
#define IFX_PSI5_CH_RDRH_TEI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_RDRH_Bits.TEI */
#define IFX_PSI5_CH_RDRH_TEI_OFF (27u)

/** \brief Length for Ifx_PSI5_CH_RDRH_Bits.NBI */
#define IFX_PSI5_CH_RDRH_NBI_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_RDRH_Bits.NBI */
#define IFX_PSI5_CH_RDRH_NBI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_RDRH_Bits.NBI */
#define IFX_PSI5_CH_RDRH_NBI_OFF (28u)

/** \brief Length for Ifx_PSI5_CH_RDRH_Bits.MEI */
#define IFX_PSI5_CH_RDRH_MEI_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_RDRH_Bits.MEI */
#define IFX_PSI5_CH_RDRH_MEI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_RDRH_Bits.MEI */
#define IFX_PSI5_CH_RDRH_MEI_OFF (29u)

/** \brief Length for Ifx_PSI5_CH_RDRH_Bits.NFI */
#define IFX_PSI5_CH_RDRH_NFI_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_RDRH_Bits.NFI */
#define IFX_PSI5_CH_RDRH_NFI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_RDRH_Bits.NFI */
#define IFX_PSI5_CH_RDRH_NFI_OFF (30u)

/** \brief Length for Ifx_PSI5_CH_RDRH_Bits.RBI */
#define IFX_PSI5_CH_RDRH_RBI_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_RDRH_Bits.RBI */
#define IFX_PSI5_CH_RDRH_RBI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_RDRH_Bits.RBI */
#define IFX_PSI5_CH_RDRH_RBI_OFF (31u)

/** \brief Length for Ifx_PSI5_CH_PGC_Bits.PLEN */
#define IFX_PSI5_CH_PGC_PLEN_LEN (6u)

/** \brief Mask for Ifx_PSI5_CH_PGC_Bits.PLEN */
#define IFX_PSI5_CH_PGC_PLEN_MSK (0x3fu)

/** \brief Offset for Ifx_PSI5_CH_PGC_Bits.PLEN */
#define IFX_PSI5_CH_PGC_PLEN_OFF (0u)

/** \brief Length for Ifx_PSI5_CH_PGC_Bits.DEL */
#define IFX_PSI5_CH_PGC_DEL_LEN (6u)

/** \brief Mask for Ifx_PSI5_CH_PGC_Bits.DEL */
#define IFX_PSI5_CH_PGC_DEL_MSK (0x3fu)

/** \brief Offset for Ifx_PSI5_CH_PGC_Bits.DEL */
#define IFX_PSI5_CH_PGC_DEL_OFF (8u)

/** \brief Length for Ifx_PSI5_CH_PGC_Bits.TBS */
#define IFX_PSI5_CH_PGC_TBS_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_PGC_Bits.TBS */
#define IFX_PSI5_CH_PGC_TBS_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_PGC_Bits.TBS */
#define IFX_PSI5_CH_PGC_TBS_OFF (15u)

/** \brief Length for Ifx_PSI5_CH_PGC_Bits.ETB */
#define IFX_PSI5_CH_PGC_ETB_LEN (3u)

/** \brief Mask for Ifx_PSI5_CH_PGC_Bits.ETB */
#define IFX_PSI5_CH_PGC_ETB_MSK (0x7u)

/** \brief Offset for Ifx_PSI5_CH_PGC_Bits.ETB */
#define IFX_PSI5_CH_PGC_ETB_OFF (16u)

/** \brief Length for Ifx_PSI5_CH_PGC_Bits.PTE */
#define IFX_PSI5_CH_PGC_PTE_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_PGC_Bits.PTE */
#define IFX_PSI5_CH_PGC_PTE_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_PGC_Bits.PTE */
#define IFX_PSI5_CH_PGC_PTE_OFF (19u)

/** \brief Length for Ifx_PSI5_CH_PGC_Bits.ETS */
#define IFX_PSI5_CH_PGC_ETS_LEN (3u)

/** \brief Mask for Ifx_PSI5_CH_PGC_Bits.ETS */
#define IFX_PSI5_CH_PGC_ETS_MSK (0x7u)

/** \brief Offset for Ifx_PSI5_CH_PGC_Bits.ETS */
#define IFX_PSI5_CH_PGC_ETS_OFF (20u)

/** \brief Length for Ifx_PSI5_CH_PGC_Bits.ETE */
#define IFX_PSI5_CH_PGC_ETE_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_PGC_Bits.ETE */
#define IFX_PSI5_CH_PGC_ETE_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_PGC_Bits.ETE */
#define IFX_PSI5_CH_PGC_ETE_OFF (23u)

/** \brief Length for Ifx_PSI5_CH_PGC_Bits.BYP */
#define IFX_PSI5_CH_PGC_BYP_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_PGC_Bits.BYP */
#define IFX_PSI5_CH_PGC_BYP_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_PGC_Bits.BYP */
#define IFX_PSI5_CH_PGC_BYP_OFF (24u)

/** \brief Length for Ifx_PSI5_CH_PGC_Bits.BOT */
#define IFX_PSI5_CH_PGC_BOT_LEN (7u)

/** \brief Mask for Ifx_PSI5_CH_PGC_Bits.BOT */
#define IFX_PSI5_CH_PGC_BOT_MSK (0x7fu)

/** \brief Offset for Ifx_PSI5_CH_PGC_Bits.BOT */
#define IFX_PSI5_CH_PGC_BOT_OFF (25u)

/** \brief Length for Ifx_PSI5_CH_CTV_Bits.CTV */
#define IFX_PSI5_CH_CTV_CTV_LEN (16u)

/** \brief Mask for Ifx_PSI5_CH_CTV_Bits.CTV */
#define IFX_PSI5_CH_CTV_CTV_MSK (0xffffu)

/** \brief Offset for Ifx_PSI5_CH_CTV_Bits.CTV */
#define IFX_PSI5_CH_CTV_CTV_OFF (0u)

/** \brief Length for Ifx_PSI5_CH_CTV_Bits.CTC */
#define IFX_PSI5_CH_CTV_CTC_LEN (16u)

/** \brief Mask for Ifx_PSI5_CH_CTV_Bits.CTC */
#define IFX_PSI5_CH_CTV_CTC_MSK (0xffffu)

/** \brief Offset for Ifx_PSI5_CH_CTV_Bits.CTC */
#define IFX_PSI5_CH_CTV_CTC_OFF (16u)

/** \brief Length for Ifx_PSI5_CH_SCR_Bits.PLL */
#define IFX_PSI5_CH_SCR_PLL_LEN (6u)

/** \brief Mask for Ifx_PSI5_CH_SCR_Bits.PLL */
#define IFX_PSI5_CH_SCR_PLL_MSK (0x3fu)

/** \brief Offset for Ifx_PSI5_CH_SCR_Bits.PLL */
#define IFX_PSI5_CH_SCR_PLL_OFF (0u)

/** \brief Length for Ifx_PSI5_CH_SCR_Bits.EPS */
#define IFX_PSI5_CH_SCR_EPS_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SCR_Bits.EPS */
#define IFX_PSI5_CH_SCR_EPS_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SCR_Bits.EPS */
#define IFX_PSI5_CH_SCR_EPS_OFF (6u)

/** \brief Length for Ifx_PSI5_CH_SCR_Bits.BSC */
#define IFX_PSI5_CH_SCR_BSC_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SCR_Bits.BSC */
#define IFX_PSI5_CH_SCR_BSC_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SCR_Bits.BSC */
#define IFX_PSI5_CH_SCR_BSC_OFF (7u)

/** \brief Length for Ifx_PSI5_CH_SCR_Bits.SSL */
#define IFX_PSI5_CH_SCR_SSL_LEN (6u)

/** \brief Mask for Ifx_PSI5_CH_SCR_Bits.SSL */
#define IFX_PSI5_CH_SCR_SSL_MSK (0x3fu)

/** \brief Offset for Ifx_PSI5_CH_SCR_Bits.SSL */
#define IFX_PSI5_CH_SCR_SSL_OFF (8u)

/** \brief Length for Ifx_PSI5_CH_SCR_Bits.FLUS */
#define IFX_PSI5_CH_SCR_FLUS_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SCR_Bits.FLUS */
#define IFX_PSI5_CH_SCR_FLUS_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SCR_Bits.FLUS */
#define IFX_PSI5_CH_SCR_FLUS_OFF (14u)

/** \brief Length for Ifx_PSI5_CH_SCR_Bits.FLUO */
#define IFX_PSI5_CH_SCR_FLUO_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SCR_Bits.FLUO */
#define IFX_PSI5_CH_SCR_FLUO_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SCR_Bits.FLUO */
#define IFX_PSI5_CH_SCR_FLUO_OFF (15u)

/** \brief Length for Ifx_PSI5_CH_SCR_Bits.SOL */
#define IFX_PSI5_CH_SCR_SOL_LEN (6u)

/** \brief Mask for Ifx_PSI5_CH_SCR_Bits.SOL */
#define IFX_PSI5_CH_SCR_SOL_MSK (0x3fu)

/** \brief Offset for Ifx_PSI5_CH_SCR_Bits.SOL */
#define IFX_PSI5_CH_SCR_SOL_OFF (16u)

/** \brief Length for Ifx_PSI5_CH_SCR_Bits.CRC */
#define IFX_PSI5_CH_SCR_CRC_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SCR_Bits.CRC */
#define IFX_PSI5_CH_SCR_CRC_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SCR_Bits.CRC */
#define IFX_PSI5_CH_SCR_CRC_OFF (22u)

/** \brief Length for Ifx_PSI5_CH_SCR_Bits.STA */
#define IFX_PSI5_CH_SCR_STA_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SCR_Bits.STA */
#define IFX_PSI5_CH_SCR_STA_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SCR_Bits.STA */
#define IFX_PSI5_CH_SCR_STA_OFF (23u)

/** \brief Length for Ifx_PSI5_CH_SCR_Bits.INH */
#define IFX_PSI5_CH_SCR_INH_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SCR_Bits.INH */
#define IFX_PSI5_CH_SCR_INH_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SCR_Bits.INH */
#define IFX_PSI5_CH_SCR_INH_OFF (24u)

/** \brief Length for Ifx_PSI5_CH_SCR_Bits.GO */
#define IFX_PSI5_CH_SCR_GO_LEN (1u)

