Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxPsi5_bf.h
/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI25 */
#define IFX_PSI5_CRCIOV_CRCI25_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI25 */
#define IFX_PSI5_CRCIOV_CRCI25_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI25 */
#define IFX_PSI5_CRCIOV_CRCI25_OFF (25u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI26 */
#define IFX_PSI5_CRCIOV_CRCI26_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI26 */
#define IFX_PSI5_CRCIOV_CRCI26_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI26 */
#define IFX_PSI5_CRCIOV_CRCI26_OFF (26u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI27 */
#define IFX_PSI5_CRCIOV_CRCI27_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI27 */
#define IFX_PSI5_CRCIOV_CRCI27_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI27 */
#define IFX_PSI5_CRCIOV_CRCI27_OFF (27u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI28 */
#define IFX_PSI5_CRCIOV_CRCI28_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI28 */
#define IFX_PSI5_CRCIOV_CRCI28_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI28 */
#define IFX_PSI5_CRCIOV_CRCI28_OFF (28u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI29 */
#define IFX_PSI5_CRCIOV_CRCI29_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI29 */
#define IFX_PSI5_CRCIOV_CRCI29_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI29 */
#define IFX_PSI5_CRCIOV_CRCI29_OFF (29u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI30 */
#define IFX_PSI5_CRCIOV_CRCI30_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI30 */
#define IFX_PSI5_CRCIOV_CRCI30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI30 */
#define IFX_PSI5_CRCIOV_CRCI30_OFF (30u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI31 */
#define IFX_PSI5_CRCIOV_CRCI31_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI31 */
#define IFX_PSI5_CRCIOV_CRCI31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI31 */
#define IFX_PSI5_CRCIOV_CRCI31_OFF (31u)

/** \brief Length for Ifx_PSI5_RDIOV_Bits.RDI0 */
#define IFX_PSI5_RDIOV_RDI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDIOV_Bits.RDI0 */
#define IFX_PSI5_RDIOV_RDI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDIOV_Bits.RDI0 */
#define IFX_PSI5_RDIOV_RDI0_OFF (0u)

/** \brief Length for Ifx_PSI5_RDIOV_Bits.RDI1 */
#define IFX_PSI5_RDIOV_RDI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDIOV_Bits.RDI1 */
#define IFX_PSI5_RDIOV_RDI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDIOV_Bits.RDI1 */
#define IFX_PSI5_RDIOV_RDI1_OFF (1u)

/** \brief Length for Ifx_PSI5_RDIOV_Bits.RDI2 */
#define IFX_PSI5_RDIOV_RDI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDIOV_Bits.RDI2 */
#define IFX_PSI5_RDIOV_RDI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDIOV_Bits.RDI2 */
#define IFX_PSI5_RDIOV_RDI2_OFF (2u)

/** \brief Length for Ifx_PSI5_RDIOV_Bits.RDI3 */
#define IFX_PSI5_RDIOV_RDI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDIOV_Bits.RDI3 */
#define IFX_PSI5_RDIOV_RDI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDIOV_Bits.RDI3 */
#define IFX_PSI5_RDIOV_RDI3_OFF (3u)

/** \brief Length for Ifx_PSI5_RDIOV_Bits.RDI4 */
#define IFX_PSI5_RDIOV_RDI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDIOV_Bits.RDI4 */
#define IFX_PSI5_RDIOV_RDI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDIOV_Bits.RDI4 */
#define IFX_PSI5_RDIOV_RDI4_OFF (4u)

/** \brief Length for Ifx_PSI5_RDIOV_Bits.RDI5 */
#define IFX_PSI5_RDIOV_RDI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDIOV_Bits.RDI5 */
#define IFX_PSI5_RDIOV_RDI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDIOV_Bits.RDI5 */
#define IFX_PSI5_RDIOV_RDI5_OFF (5u)

/** \brief Length for Ifx_PSI5_RDIOV_Bits.RDI6 */
#define IFX_PSI5_RDIOV_RDI6_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDIOV_Bits.RDI6 */
#define IFX_PSI5_RDIOV_RDI6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDIOV_Bits.RDI6 */
#define IFX_PSI5_RDIOV_RDI6_OFF (6u)

/** \brief Length for Ifx_PSI5_RDIOV_Bits.RDI7 */
#define IFX_PSI5_RDIOV_RDI7_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDIOV_Bits.RDI7 */
#define IFX_PSI5_RDIOV_RDI7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDIOV_Bits.RDI7 */
#define IFX_PSI5_RDIOV_RDI7_OFF (7u)

/** \brief Length for Ifx_PSI5_RDIOV_Bits.RDI8 */
#define IFX_PSI5_RDIOV_RDI8_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDIOV_Bits.RDI8 */
#define IFX_PSI5_RDIOV_RDI8_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDIOV_Bits.RDI8 */
#define IFX_PSI5_RDIOV_RDI8_OFF (8u)

/** \brief Length for Ifx_PSI5_RDIOV_Bits.RDI9 */
#define IFX_PSI5_RDIOV_RDI9_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDIOV_Bits.RDI9 */
#define IFX_PSI5_RDIOV_RDI9_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDIOV_Bits.RDI9 */
#define IFX_PSI5_RDIOV_RDI9_OFF (9u)

/** \brief Length for Ifx_PSI5_RDIOV_Bits.RDI10 */
#define IFX_PSI5_RDIOV_RDI10_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDIOV_Bits.RDI10 */
#define IFX_PSI5_RDIOV_RDI10_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDIOV_Bits.RDI10 */
#define IFX_PSI5_RDIOV_RDI10_OFF (10u)

/** \brief Length for Ifx_PSI5_RDIOV_Bits.RDI11 */
#define IFX_PSI5_RDIOV_RDI11_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDIOV_Bits.RDI11 */
#define IFX_PSI5_RDIOV_RDI11_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDIOV_Bits.RDI11 */
#define IFX_PSI5_RDIOV_RDI11_OFF (11u)

/** \brief Length for Ifx_PSI5_RDIOV_Bits.RDI12 */
#define IFX_PSI5_RDIOV_RDI12_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDIOV_Bits.RDI12 */
#define IFX_PSI5_RDIOV_RDI12_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDIOV_Bits.RDI12 */
#define IFX_PSI5_RDIOV_RDI12_OFF (12u)

/** \brief Length for Ifx_PSI5_RDIOV_Bits.RDI13 */
#define IFX_PSI5_RDIOV_RDI13_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDIOV_Bits.RDI13 */
#define IFX_PSI5_RDIOV_RDI13_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDIOV_Bits.RDI13 */
#define IFX_PSI5_RDIOV_RDI13_OFF (13u)

/** \brief Length for Ifx_PSI5_RDIOV_Bits.RDI14 */
#define IFX_PSI5_RDIOV_RDI14_LEN (1u)

/** \brief Mask for Ifx_PSI5_RDIOV_Bits.RDI14 */
#define IFX_PSI5_RDIOV_RDI14_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RDIOV_Bits.RDI14 */
#define IFX_PSI5_RDIOV_RDI14_OFF (14u)

/** \brief Length for Ifx_PSI5_RDIOV_Bits.RDI15 */
#define IFX_PSI5_RDIOV_RDI15_LEN (1u)

