Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxPsi5_bf.h
/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI13 */
#define IFX_PSI5_NBICLR_NBI13_OFF (13u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI14 */
#define IFX_PSI5_NBICLR_NBI14_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI14 */
#define IFX_PSI5_NBICLR_NBI14_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI14 */
#define IFX_PSI5_NBICLR_NBI14_OFF (14u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI15 */
#define IFX_PSI5_NBICLR_NBI15_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI15 */
#define IFX_PSI5_NBICLR_NBI15_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI15 */
#define IFX_PSI5_NBICLR_NBI15_OFF (15u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI16 */
#define IFX_PSI5_NBICLR_NBI16_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI16 */
#define IFX_PSI5_NBICLR_NBI16_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI16 */
#define IFX_PSI5_NBICLR_NBI16_OFF (16u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI17 */
#define IFX_PSI5_NBICLR_NBI17_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI17 */
#define IFX_PSI5_NBICLR_NBI17_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI17 */
#define IFX_PSI5_NBICLR_NBI17_OFF (17u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI18 */
#define IFX_PSI5_NBICLR_NBI18_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI18 */
#define IFX_PSI5_NBICLR_NBI18_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI18 */
#define IFX_PSI5_NBICLR_NBI18_OFF (18u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI19 */
#define IFX_PSI5_NBICLR_NBI19_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI19 */
#define IFX_PSI5_NBICLR_NBI19_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI19 */
#define IFX_PSI5_NBICLR_NBI19_OFF (19u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI20 */
#define IFX_PSI5_NBICLR_NBI20_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI20 */
#define IFX_PSI5_NBICLR_NBI20_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI20 */
#define IFX_PSI5_NBICLR_NBI20_OFF (20u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI21 */
#define IFX_PSI5_NBICLR_NBI21_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI21 */
#define IFX_PSI5_NBICLR_NBI21_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI21 */
#define IFX_PSI5_NBICLR_NBI21_OFF (21u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI22 */
#define IFX_PSI5_NBICLR_NBI22_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI22 */
#define IFX_PSI5_NBICLR_NBI22_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI22 */
#define IFX_PSI5_NBICLR_NBI22_OFF (22u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI23 */
#define IFX_PSI5_NBICLR_NBI23_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI23 */
#define IFX_PSI5_NBICLR_NBI23_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI23 */
#define IFX_PSI5_NBICLR_NBI23_OFF (23u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI24 */
#define IFX_PSI5_NBICLR_NBI24_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI24 */
#define IFX_PSI5_NBICLR_NBI24_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI24 */
#define IFX_PSI5_NBICLR_NBI24_OFF (24u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI25 */
#define IFX_PSI5_NBICLR_NBI25_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI25 */
#define IFX_PSI5_NBICLR_NBI25_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI25 */
#define IFX_PSI5_NBICLR_NBI25_OFF (25u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI26 */
#define IFX_PSI5_NBICLR_NBI26_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI26 */
#define IFX_PSI5_NBICLR_NBI26_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI26 */
#define IFX_PSI5_NBICLR_NBI26_OFF (26u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI27 */
#define IFX_PSI5_NBICLR_NBI27_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI27 */
#define IFX_PSI5_NBICLR_NBI27_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI27 */
#define IFX_PSI5_NBICLR_NBI27_OFF (27u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI28 */
#define IFX_PSI5_NBICLR_NBI28_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI28 */
#define IFX_PSI5_NBICLR_NBI28_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI28 */
#define IFX_PSI5_NBICLR_NBI28_OFF (28u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI29 */
#define IFX_PSI5_NBICLR_NBI29_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI29 */
#define IFX_PSI5_NBICLR_NBI29_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI29 */
#define IFX_PSI5_NBICLR_NBI29_OFF (29u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI30 */
#define IFX_PSI5_NBICLR_NBI30_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI30 */
#define IFX_PSI5_NBICLR_NBI30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI30 */
#define IFX_PSI5_NBICLR_NBI30_OFF (30u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI31 */
#define IFX_PSI5_NBICLR_NBI31_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI31 */
#define IFX_PSI5_NBICLR_NBI31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI31 */
#define IFX_PSI5_NBICLR_NBI31_OFF (31u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI0 */
#define IFX_PSI5_TEICLR_TEI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI0 */
#define IFX_PSI5_TEICLR_TEI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI0 */
#define IFX_PSI5_TEICLR_TEI0_OFF (0u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI1 */
#define IFX_PSI5_TEICLR_TEI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI1 */
#define IFX_PSI5_TEICLR_TEI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI1 */
#define IFX_PSI5_TEICLR_TEI1_OFF (1u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI2 */
#define IFX_PSI5_TEICLR_TEI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI2 */
#define IFX_PSI5_TEICLR_TEI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI2 */
#define IFX_PSI5_TEICLR_TEI2_OFF (2u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI3 */
#define IFX_PSI5_TEICLR_TEI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI3 */
#define IFX_PSI5_TEICLR_TEI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI3 */
#define IFX_PSI5_TEICLR_TEI3_OFF (3u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI4 */
#define IFX_PSI5_TEICLR_TEI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI4 */
#define IFX_PSI5_TEICLR_TEI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI4 */
#define IFX_PSI5_TEICLR_TEI4_OFF (4u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI5 */
#define IFX_PSI5_TEICLR_TEI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI5 */
#define IFX_PSI5_TEICLR_TEI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI5 */
#define IFX_PSI5_TEICLR_TEI5_OFF (5u)

