Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxPsi5_bf.h
/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI6 */
#define IFX_PSI5_TEICLR_TEI6_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI6 */
#define IFX_PSI5_TEICLR_TEI6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI6 */
#define IFX_PSI5_TEICLR_TEI6_OFF (6u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI7 */
#define IFX_PSI5_TEICLR_TEI7_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI7 */
#define IFX_PSI5_TEICLR_TEI7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI7 */
#define IFX_PSI5_TEICLR_TEI7_OFF (7u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI8 */
#define IFX_PSI5_TEICLR_TEI8_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI8 */
#define IFX_PSI5_TEICLR_TEI8_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI8 */
#define IFX_PSI5_TEICLR_TEI8_OFF (8u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI9 */
#define IFX_PSI5_TEICLR_TEI9_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI9 */
#define IFX_PSI5_TEICLR_TEI9_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI9 */
#define IFX_PSI5_TEICLR_TEI9_OFF (9u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI10 */
#define IFX_PSI5_TEICLR_TEI10_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI10 */
#define IFX_PSI5_TEICLR_TEI10_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI10 */
#define IFX_PSI5_TEICLR_TEI10_OFF (10u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI11 */
#define IFX_PSI5_TEICLR_TEI11_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI11 */
#define IFX_PSI5_TEICLR_TEI11_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI11 */
#define IFX_PSI5_TEICLR_TEI11_OFF (11u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI12 */
#define IFX_PSI5_TEICLR_TEI12_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI12 */
#define IFX_PSI5_TEICLR_TEI12_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI12 */
#define IFX_PSI5_TEICLR_TEI12_OFF (12u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI13 */
#define IFX_PSI5_TEICLR_TEI13_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI13 */
#define IFX_PSI5_TEICLR_TEI13_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI13 */
#define IFX_PSI5_TEICLR_TEI13_OFF (13u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI14 */
#define IFX_PSI5_TEICLR_TEI14_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI14 */
#define IFX_PSI5_TEICLR_TEI14_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI14 */
#define IFX_PSI5_TEICLR_TEI14_OFF (14u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI15 */
#define IFX_PSI5_TEICLR_TEI15_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI15 */
#define IFX_PSI5_TEICLR_TEI15_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI15 */
#define IFX_PSI5_TEICLR_TEI15_OFF (15u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI16 */
#define IFX_PSI5_TEICLR_TEI16_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI16 */
#define IFX_PSI5_TEICLR_TEI16_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI16 */
#define IFX_PSI5_TEICLR_TEI16_OFF (16u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI17 */
#define IFX_PSI5_TEICLR_TEI17_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI17 */
#define IFX_PSI5_TEICLR_TEI17_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI17 */
#define IFX_PSI5_TEICLR_TEI17_OFF (17u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI18 */
#define IFX_PSI5_TEICLR_TEI18_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI18 */
#define IFX_PSI5_TEICLR_TEI18_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI18 */
#define IFX_PSI5_TEICLR_TEI18_OFF (18u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI19 */
#define IFX_PSI5_TEICLR_TEI19_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI19 */
#define IFX_PSI5_TEICLR_TEI19_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI19 */
#define IFX_PSI5_TEICLR_TEI19_OFF (19u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI20 */
#define IFX_PSI5_TEICLR_TEI20_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI20 */
#define IFX_PSI5_TEICLR_TEI20_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI20 */
#define IFX_PSI5_TEICLR_TEI20_OFF (20u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI21 */
#define IFX_PSI5_TEICLR_TEI21_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI21 */
#define IFX_PSI5_TEICLR_TEI21_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI21 */
#define IFX_PSI5_TEICLR_TEI21_OFF (21u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI22 */
#define IFX_PSI5_TEICLR_TEI22_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI22 */
#define IFX_PSI5_TEICLR_TEI22_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI22 */
#define IFX_PSI5_TEICLR_TEI22_OFF (22u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI23 */
#define IFX_PSI5_TEICLR_TEI23_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI23 */
#define IFX_PSI5_TEICLR_TEI23_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI23 */
#define IFX_PSI5_TEICLR_TEI23_OFF (23u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI24 */
#define IFX_PSI5_TEICLR_TEI24_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI24 */
#define IFX_PSI5_TEICLR_TEI24_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI24 */
#define IFX_PSI5_TEICLR_TEI24_OFF (24u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI25 */
#define IFX_PSI5_TEICLR_TEI25_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI25 */
#define IFX_PSI5_TEICLR_TEI25_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI25 */
#define IFX_PSI5_TEICLR_TEI25_OFF (25u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI26 */
#define IFX_PSI5_TEICLR_TEI26_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI26 */
#define IFX_PSI5_TEICLR_TEI26_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI26 */
#define IFX_PSI5_TEICLR_TEI26_OFF (26u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI27 */
#define IFX_PSI5_TEICLR_TEI27_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI27 */
#define IFX_PSI5_TEICLR_TEI27_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI27 */
#define IFX_PSI5_TEICLR_TEI27_OFF (27u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI28 */
#define IFX_PSI5_TEICLR_TEI28_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI28 */
#define IFX_PSI5_TEICLR_TEI28_MSK (0x1u)

